app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    render json: Todo.find_by(id: params[:id])

INSERT INTO "todos" ("title", "body", "done") VALUES ($1, $2, $3) RETURNING "id"  [["title", "do homework"], ["body", "math and reading"], ["done", false]]
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "todos" SET "body" = $1, "done" = $2 WHERE "todos"."id" = $3  [["body", "math, reading, and science"], ["done", true], ["id", 4]]
---
  def update
    @todo = Todo.find_by(id: params[:id])
    if @todo.update_attributes(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 4]]
SELECT "todos".* FROM "todos"
---
  def destroy
    @todo = Todo.find_by(id: params[:id])
    if @todo.destroy
      render json: Todo.all